# RailStructure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RailingType..::..RailStructure Property
RailingType Class See Also
---
The NonContinuousRailStructure.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public NonContinuousRailStructure RailStructure { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RailStructure As NonContinuousRailStructure
	Get
```

Visual C++
---
```text
public:
property NonContinuousRailStructure^ RailStructure {
	NonContinuousRailStructure^ get ();
}
```

# See Also
RailingType Class
Autodesk.Revit.DB.Architecture Namespace